tutorials/AC-DBD/old_cases/actuator/AC-DBD/3D/Svarnas2021_baffleEle/flow/constant/forceDict
/*--------------------------------*- C++ -*----------------------------------*  =========                 |
  \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \    /   O peration     | Website:  https://openfoam.org
    \  /    A nd           | Version:  7
     \/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      forceDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

forceTimes
(
0
0.02e-5
0.04e-5
0.06e-5
0.08e-5
0.10e-5
0.12e-5
0.14e-5
0.16e-5
0.18e-5
0.20e-5
0.22e-5
0.24e-5
0.26e-5
0.28e-5
0.30e-5
0.32e-5
0.34e-5
0.36e-5
0.38e-5
0.40e-5
0.42e-5
0.44e-5
0.46e-5
0.48e-5
0.50e-5
5e-06
5.001e-06
5.064376957e-06
5.136762665e-06
0.52e-5
5.201955124e-06
5.259515507e-06
5.328808426e-06
5.39022015e-06
0.54e-5
5.453679723e-06
5.519342918e-06
5.587325585e-06
0.56e-5
5.645829901e-06
5.718414089e-06
5.781067577e-06
0.58e-5
5.845914853e-06
5.913193501e-06
5.983165778e-06
0.60e-5
6.041271165e-06
6.101432269e-06
6.179767946e-06
0.62e-5
6.245149344e-06
6.313153654e-06
6.366006641e-06
0.64e-5
6.439123673e-06
6.496092786e-06
6.575118798e-06
0.66e-5
6.636863453e-06
6.700908718e-06
6.767424487e-06
0.68e-5
6.836605346e-06
6.908670366e-06
6.983878973e-06
0.70e-5
7.035900693e-06
7.117010655e-06
7.173301645e-06
0.72e-5
7.259697962e-06
7.318199449e-06
7.377419084e-06
0.74e-5
7.467599371e-06
7.52861486e-06
7.590345237e-06
0.76e-5
7.684281661e-06
7.747804279e-06
0.78e-5
7.812040052e-06
7.876984082e-06
7.975721959e-06
0.80e-5
8.042417274e-06
8.109807946e-06
8.177885202e-06
0.82e-5
8.281292765e-06
8.351088414e-06
0.84e-5
8.421571214e-06
8.49271595e-06
8.564522382e-06
0.86e-5
8.67347708e-06
8.746925126e-06
0.88e-5
8.821009085e-06
8.895726125e-06
0.90e-5
9.008939367e-06
9.08516842e-06
9.161977399e-06
0.92e-5
9.278365413e-06
9.317435468e-06
0.94e-5
0.96e-5
0.98e-5
);

forceNames
(
Fc0
Fc1
Fc2
Fc3
Fc4
Fc5
Fc6
Fc7
Fc8
Fc9
Fc10
Fc11
Fc12
Fc13
Fc14
Fc15
Fc16
Fc17
Fc18
Fc19
Fc20
Fc21
Fc22
Fc23
Fc24
Fc25
Fc26
Fc27
Fc28
Fc29
Fc30
Fc31
Fc32
Fc33
Fc34
Fc35
Fc36
Fc37
Fc38
Fc39
Fc40
Fc41
Fc42
Fc43
Fc44
Fc45
Fc46
Fc47
Fc48
Fc49
Fc50
Fc51
Fc52
Fc53
Fc54
Fc55
Fc56
Fc57
Fc58
Fc59
Fc60
Fc61
Fc62
Fc63
Fc64
Fc65
Fc66
Fc67
Fc68
Fc69
Fc70
Fc71
Fc72
Fc73
Fc74
Fc75
Fc76
Fc77
Fc78
Fc79
Fc80
Fc81
Fc82
Fc83
Fc84
Fc85
Fc86
Fc87
Fc88
Fc89
Fc90
Fc91
Fc92
Fc93
Fc94
Fc95
Fc96
Fc97
Fc98
Fc99
Fc100
Fc101
Fc102
Fc103
Fc104
Fc105
Fc106
Fc107
Fc108
Fc109
Fc110
Fc111
);
