tutorials/AC-DBD/old_cases/actuator/AC-DBD/3D/Svarnas2021_baffleEle/flow/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    // "rho.*"
    // {
    //     solver           diagonal;
    // }

    // p
    // {
    //     solver           GAMG;
    //     smoother         DICGaussSeidel;
    //     tolerance        1e-7;
    //     relTol           0.01;
    // }

    // pFinal
    // {
    //     $p;
    //     relTol          0;
    // }

    // "(U|e|tracer)"
    // {
    //     solver          PBiCGStab;
    //     preconditioner  DILU;
    //     tolerance       1e-05;
    //     relTol          0.1;
    // }

    // "(U|e|tracer)Final"
    // {
    //     $U;
    //     relTol          0;
    // }

    "(p|rho)"
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-6;
        relTol          0.01;
    }

    "(p|rho)Final"
    {
        $p;
        relTol          0;
    }

    "(U|e|k|nuTilda)"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-6;
        relTol          0.01;
    }

    "(U|e|k|nuTilda)Final"
    {
        $U;
        relTol          0;
    }
}

PIMPLE
{
    nNonOrthogonalCorrectors 0;
    nCorrectors         2;
}

// PIMPLE
// {
//     momentumPredictor yes;
//     nOuterCorrectors 3;
//     nCorrectors     1;
//     nNonOrthogonalCorrectors 0;

//     pMinFactor      0.5;
//     pMaxFactor      2.0;
// }

relaxationFactors
{
    equations
    {
        ".*"  1;
    }
}

// ************************************************************************* //
